app/controllers/bookings_controller.rb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" IN ($1, $2)  [["id", 9], ["id", 1]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 2]]
SELECT "bookings".* FROM "bookings"
---
  def index
    if params[:user_id].present?
      bookings = Booking.where(user_id: params[:user_id]).includes(:room)
    else
      bookings = Booking.includes(:room)

INSERT INTO "bookings" ("check_in_date", "check_out_date", "number_of_rooms", "user_id", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    booking = Booking.new(booking_params)
    if booking.save

UPDATE "bookings" SET "check_in_date" = $1, "check_out_date" = $2, "updated_at" = $3 WHERE "bookings"."id" = $4  [["check_in_date", "2024-04-08"], ["check_out_date", "2024-04-08"], ["updated_at", "2024-03-27 04:07:29.249642"], ["id", 2]]
---
  def update
    if @booking.update(booking_params)

DELETE FROM "bookings" WHERE "bookings"."id" = $1  [["id", 2]]
---
  def destroy
    @booking.destroy

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_booking
    @booking = Booking.find(params[:id])