app/controllers/bookings_controller.rb

INSERT INTO "bookings" ("check_in_date", "check_out_date", "number_of_rooms", "user_id", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    booking = Booking.new(booking_params)
    if booking.save

UPDATE "bookings" SET "check_in_date" = $1, "check_out_date" = $2, "number_of_rooms" = $3, "updated_at" = $4 WHERE "bookings"."id" = $5  [["check_in_date", "2024-03-28"], ["check_out_date", "2024-03-28"], ["number_of_rooms", 3], ["updated_at", "2024-03-27 05:38:16.556294"], ["id", 27]]
---
  def update
    if @booking.update(booking_params)

DELETE FROM "bookings" WHERE "bookings"."id" = $1  [["id", 37]]
---
  def destroy
    @booking.destroy