app/controllers/hotels_controller.rb

  def index
    if params[:location].present?
      hotels = Hotel.where(location: params[:location])
---
SELECT "hotels".* FROM "hotels" WHERE "hotels"."location" = $1  [["location", "CityX"]]