app/models/booking.rb

  def check_room_availability
    if Booking.exists?(room_id: room_id, check_in_date: check_in_date..check_out_date)
---
SELECT 1 AS one FROM "bookings" WHERE "bookings"."room_id" = $1 AND "bookings"."check_in_date" BETWEEN $2 AND $3 LIMIT $4  [["room_id", 8], ["check_in_date", "2024-04-07"], ["check_in_date", "2024-04-07"], ["LIMIT", 1]]